micropython/micropython/ports/esp32/machine_can.c
    // clear errors
    self->num_error_warning = 0;
    self->num_error_passive = 0;
    self->num_bus_off = 0;

    // Configure device
    self->g_config.mode = args[ARG_mode].u_int & 0x0F;
    self->g_config.tx_io = args[ARG_tx_io].u_int;
    self->g_config.rx_io = args[ARG_rx_io].u_int;
    self->g_config.clkout_io = args[ARG_clkout_io].u_int;
    self->g_config.bus_off_io = args[ARG_bus_off_io].u_int;
    self->g_config.tx_queue_len = args[ARG_tx_queue].u_int;
    self->g_config.rx_queue_len = args[ARG_rx_queue].u_int;
    self->g_config.alerts_enabled = TWAI_ALERT_ALL;
    // TWAI_ALERT_AND_LOG || TWAI_ALERT_BELOW_ERR_WARN || TWAI_ALERT_ERR_ACTIVE || TWAI_ALERT_BUS_RECOVERED ||
    // TWAI_ALERT_ABOVE_ERR_WARN || TWAI_ALERT_BUS_ERROR || TWAI_ALERT_ERR_PASS || TWAI_ALERT_BUS_OFF;
    self->g_config.clkout_divider = 0;
    self->loopback = ((args[ARG_mode].u_int & TWAI_MODE_NO_ACK) > 0);
    self->extframe = args[ARG_extframe].u_bool;
    if (args[ARG_auto_restart].u_bool) {
        mp_raise_NotImplementedError(MP_ERROR_TEXT("Auto-restart not supported"));
    }

    self->f_config = (twai_filter_config_t)TWAI_FILTER_CONFIG_ACCEPT_ALL();

    // Calculate CAN nominal bit timing from bitrate if provided
    self->bitrate = args[ARG_bitrate].u_int;
    switch (self->bitrate) {
        case 0:
            self->t_config = (twai_timing_config_t) {
                .brp = args[ARG_prescaler].u_int,
                .sjw = args[ARG_sjw].u_int,
                .tseg_1 = args[ARG_bs1].u_int,
                .tseg_2 = args[ARG_bs2].u_int,
                .triple_sampling = false
            };
            break;
        #ifdef TWAI_TIMING_CONFIG_1KBITS
        case 1000:
            self->t_config = (twai_timing_config_t)TWAI_TIMING_CONFIG_1KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_5KBITS
        case 5000:
            self->t_config = (twai_timing_config_t)TWAI_TIMING_CONFIG_5KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_10KBITS
        case 10000:
            self->t_config = (twai_timing_config_t)TWAI_TIMING_CONFIG_10KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_12_5KBITS
        case 12500:
            self->t_config = (twai_timing_config_t)TWAI_TIMING_CONFIG_12_5KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_16KBITS
        case 16000:
            self->t_config = (twai_timing_config_t)TWAI_TIMING_CONFIG_16KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_20KBITS
        case 20000:
            self->t_config = (twai_timing_config_t)TWAI_TIMING_CONFIG_20KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_25KBITS
        case 25000:
            self->t_config = (twai_timing_config_t)TWAI_TIMING_CONFIG_25KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_50KBITS
        case 50000:
            self->t_config = (twai_timing_config_t)TWAI_TIMING_CONFIG_50KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_100KBITS
        case 100000:
            self->t_config = (twai_timing_config_t)TWAI_TIMING_CONFIG_100KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_125KBITS
        case 125000:
            self->t_config = (twai_timing_config_t)TWAI_TIMING_CONFIG_125KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_250KBITS
        case 250000:
            self->t_config = (twai_timing_config_t)TWAI_TIMING_CONFIG_250KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_500KBITS
        case 500000:
            self->t_config = (twai_timing_config_t)TWAI_TIMING_CONFIG_500KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_800KBITS
        case 800000:
            self->t_config = (twai_timing_config_t)TWAI_TIMING_CONFIG_800KBITS();
            break;
        #endif
        #ifdef TWAI_TIMING_CONFIG_1MBITS
        case 1000000:
            self->t_config = (twai_timing_config_t)TWAI_TIMING_CONFIG_1MBITS();
            break;
        #endif
        default:
            self->bitrate = 0;
            mp_raise_ValueError(MP_ERROR_TEXT("Unable to set bitrate"));
            return mp_const_none;
    }

    check_esp_err(twai_driver_install_v2(&self->g_config, &self->t_config, &self->f_config, &self->handle));
    check_esp_err(twai_start_v2(self->handle));
    if (xTaskCreatePinnedToCore(machine_can_irq_task, "can_irq_task", CAN_TASK_STACK_SIZE, self, CAN_TASK_PRIORITY, (TaskHandle_t *)&self->irq_handler, MP_TASK_COREID) != pdPASS) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("failed to create can irq task handler"));
    }
    return mp_const_none;
}

// CAN(bus, ...) No argument to get the object
// If no arguments are provided, the initialized object will be returned
static mp_obj_t machine_can_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    // check arguments
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);
    if (mp_obj_is_int(args[0]) != true) {
        mp_raise_TypeError(MP_ERROR_TEXT("bus must be a number"));
    }

    // work out port
    mp_uint_t can_idx = mp_obj_get_int(args[0]);
    if (can_idx > SOC_TWAI_CONTROLLER_NUM - 1) {
//        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("out of CAN controllers:%d"), SOC_TWAI_CONTROLLER_NUM);
    }

    machine_can_obj_t *self = mp_obj_malloc(machine_can_obj_t, &machine_can_type);
    machine_can_objs[can_idx] = self;

    self->g_config = (twai_general_config_t)TWAI_GENERAL_CONFIG_DEFAULT_V2(can_idx, GPIO_NUM_4, GPIO_NUM_5, TWAI_MODE_NORMAL);
    self->f_config = (twai_filter_config_t)TWAI_FILTER_CONFIG_ACCEPT_ALL();
    self->t_config = (twai_timing_config_t)TWAI_TIMING_CONFIG_500KBITS();
    self->handle = NULL;

    self->status.state = STOPPED;
    if (n_args > 1 || n_kw > 0) {
        self->tx_callback = mp_const_none;
        self->rx_callback = mp_const_none;
        self->irq_handler = NULL;
        self->rx_state = RX_STATE_FIFO_EMPTY;

