micropython/micropython/ports/esp32/machine_can.c
        if (n_args > 1 || n_kw > 0) {
            // start the peripheral
            mp_map_t kw_args;
            mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
            machine_can_init_helper(self, n_args - 1, args + 1, &kw_args);
        }
    }
    return MP_OBJ_FROM_PTR(self);
}

// init(tx, rx, bitrate, mode=NORMAL, tx_queue=2, rx_queue=5)
static mp_obj_t machine_can_init(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    machine_can_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);
    if (self->handle) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("Driver is already initialized"));
        return mp_const_none;
    }
    return machine_can_init_helper(self, n_args - 1, pos_args + 1, kw_args);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(machine_can_init_obj, 4, machine_can_init);

// deinit()
static mp_obj_t machine_can_deinit(const mp_obj_t self_in) {
    machine_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    can_deinit(self);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_can_deinit_obj, machine_can_deinit);

// CAN.restart()
// Force a software restart of the controller, to allow transmission after a bus error
static mp_obj_t machine_can_restart(mp_obj_t self_in) {
    machine_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    check_esp_err(twai_get_status_info_v2(self->handle, &self->status));

    self->bus_recovery_success = -1;
    check_esp_err(twai_initiate_recovery_v2(self->handle));
    mp_hal_delay_ms(200); // FIXME: replace it with a smarter solution

    while (self->bus_recovery_success < 0) {
        MICROPY_EVENT_POLL_HOOK;
    }

    if (self->bus_recovery_success) {
        check_esp_err(twai_start_v2(self->handle));
    } else {
        mp_raise_OSError(MP_EIO);
    }
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_can_restart_obj, machine_can_restart);

// Get the state of the controller
static mp_obj_t machine_can_state(mp_obj_t self_in) {
    machine_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    check_esp_err(twai_get_status_info_v2(self->handle, &self->status));
    return mp_obj_new_int(self->status.state);
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_can_state_obj, machine_can_state);

// info() -- Get info about error states and TX/RX buffers
static mp_obj_t machine_can_get_counters(size_t n_args, const mp_obj_t *args) {
    machine_can_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    check_esp_err(twai_get_status_info_v2(self->handle, &self->status));
    mp_obj_t dict = mp_obj_new_dict(0);
    #define dict_key(key) mp_obj_new_str(#key, strlen(#key))
    #define dict_value(key) MP_OBJ_NEW_SMALL_INT(self->status.key)
    #define dict_store(key) mp_obj_dict_store(dict, dict_key(key), dict_value(key));
    dict_store(state);
    dict_store(msgs_to_tx);
    dict_store(msgs_to_rx);
    dict_store(tx_error_counter);
    dict_store(rx_error_counter);
    dict_store(tx_failed_count);
    dict_store(rx_missed_count);
    dict_store(rx_overrun_count);
    dict_store(arb_lost_count);
    dict_store(bus_error_count);
    return dict;
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_can_get_counters_obj, 1, 2, machine_can_get_counters);

// Get Alert info
static mp_obj_t machine_can_alert(mp_obj_t self_in) {
    const machine_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    uint32_t alerts;
    check_esp_err(twai_read_alerts_v2(self->handle, &alerts, 0));
    return mp_obj_new_int(alerts);
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_can_alert_obj, machine_can_alert);

/*
// any() - return `True` if any message waiting, else `False`
static mp_obj_t machine_can_any(mp_obj_t self_in) {
    machine_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    check_esp_err(twai_get_status_info_v2(self->handle, &self->status));
    return mp_obj_new_bool((self->status.msgs_to_rx) > 0);
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_can_any_obj, machine_can_any);
*/

// send([data], id, *, timeout=0, rtr=false, extframe=false)
// CAN.send(identifier, data, flags=0, fifo_equal=True)
static mp_obj_t machine_can_send(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_data, ARG_id, ARG_timeout, ARG_rtr, ARG_extframe };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_data,     MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_id,       MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_timeout,  MP_ARG_KW_ONLY | MP_ARG_INT,  {.u_int = 0} },
        { MP_QSTR_rtr,      MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false} },
        { MP_QSTR_extframe, MP_ARG_BOOL,                  {.u_bool = false} },
    };

    // parse args
    machine_can_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // populate message
    twai_message_t tx_msg = {0};

    size_t length;
    mp_obj_t *items;
    mp_obj_get_array(args[ARG_data].u_obj, &length, &items);
    if (length > CAN_MAX_DATA_FRAME) {
        mp_raise_ValueError(MP_ERROR_TEXT("CAN data field too long"));
    }
    tx_msg.data_length_code = length;
    tx_msg.rtr = (args[ARG_rtr].u_bool ? 1 : 0);

    if (args[ARG_extframe].u_bool) {
        tx_msg.identifier = args[ARG_id].u_int & 0x1FFFFFFF;
        tx_msg.extd = 1;
    } else {
        tx_msg.identifier = args[ARG_id].u_int & 0x7FF;
    }
    if (self->loopback) {
        tx_msg.self = 1;
    }

    for (uint8_t i = 0; i < length; i++) {
        tx_msg.data[i] = mp_obj_get_int(items[i]);
    }

    check_esp_err(twai_get_status_info_v2(self->handle, &self->status));
    // debug_printf("state:%d", self->status.state);
    if (self->status.state == TWAI_STATE_RUNNING) {
        uint32_t timeout_ms = args[ARG_timeout].u_int;

        if (timeout_ms != 0) {
            self->last_tx_success = 0;
            uint32_t start = mp_hal_ticks_ms();
            check_esp_err(twai_transmit_v2(self->handle, &tx_msg, pdMS_TO_TICKS(timeout_ms)));
            while (!self->last_tx_success) {
                if (timeout_ms != portMAX_DELAY) {
                    if (mp_hal_ticks_ms() - start >= timeout_ms) {
                        mp_raise_OSError(MP_ETIMEDOUT);
                    }
                }
                MICROPY_EVENT_POLL_HOOK;
            }

            if (!self->last_tx_success) {
                mp_raise_OSError(MP_EIO);
            }
        } else {
            check_esp_err(twai_transmit_v2(self->handle, &tx_msg, portMAX_DELAY));
        }

        return mp_const_none;
    } else {
        mp_raise_msg_varg(&mp_type_RuntimeError, MP_ERROR_TEXT("Driver is not in running state:%d"), self->status.state);
    }
}
static MP_DEFINE_CONST_FUN_OBJ_KW(machine_can_send_obj, 3, machine_can_send);

// CAN.recv(list=None, *, timeout=5000)
static mp_obj_t machine_can_recv(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    machine_can_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);
    enum { ARG_list, ARG_timeout };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_list, MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_timeout, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 5000} },
    };

    // parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    uint32_t timeout_ms = args[ARG_timeout].u_int;

    check_esp_err(twai_get_status_info_v2(self->handle, &self->status));
    // debug_printf("1 state:%d", self->status.state);
    uint32_t start = mp_hal_ticks_ms();
    while (self->status.state != TWAI_STATE_RUNNING) {
        if (timeout_ms != portMAX_DELAY) {
            if (mp_hal_ticks_ms() - start >= timeout_ms) {
                mp_raise_OSError(MP_ETIMEDOUT);
            }
        }
        MICROPY_EVENT_POLL_HOOK;
        check_esp_err(twai_get_status_info_v2(self->handle, &self->status));
    }
    // debug_printf("2 state:%d", self->status.state);

    // receive the data
    twai_message_t rx_msg;
    check_esp_err(twai_receive_v2(self->handle, &rx_msg, pdMS_TO_TICKS(timeout_ms)));
    uint32_t rx_dlc = rx_msg.data_length_code;

    // Create the tuple, or get the list, that will hold the return values
    // Also populate the fourth element, either a new bytes or reuse existing memoryview
    mp_obj_t ret_obj = args[ARG_list].u_obj;
    mp_obj_t *items;
    if (ret_obj == mp_const_none) {
        ret_obj = mp_obj_new_tuple(4, NULL);
        items = ((mp_obj_tuple_t *)MP_OBJ_TO_PTR(ret_obj))->items;
        items[3] = mp_obj_new_bytes(rx_msg.data, rx_dlc);
    } else {
        // User should provide a list of length at least 4 to hold the values
        if (!mp_obj_is_type(ret_obj, &mp_type_list)) {
            mp_raise_TypeError(NULL);
        }
        mp_obj_list_t *list = MP_OBJ_TO_PTR(ret_obj);
        if (list->len < 4) {
            mp_raise_ValueError(NULL);
        }
        items = list->items;
        // Fourth element must be a memoryview which we assume points to a
        // byte-like array which is large enough, and then we resize it inplace
        if (!mp_obj_is_type(items[3], &mp_type_memoryview)) {
            mp_raise_TypeError(NULL);
        }
        mp_obj_array_t *mv = MP_OBJ_TO_PTR(items[3]);
        if (!(mv->typecode == (MP_OBJ_ARRAY_TYPECODE_FLAG_RW | BYTEARRAY_TYPECODE) || (mv->typecode | 0x20) == (MP_OBJ_ARRAY_TYPECODE_FLAG_RW | 'b'))) {
            mp_raise_ValueError(NULL);
        }
        mv->len = rx_dlc;
        memcpy(mv->items, rx_msg.data, rx_dlc);
    }
    items[0] = MP_OBJ_NEW_SMALL_INT(rx_msg.identifier);
    items[1] = rx_msg.extd ? mp_const_true : mp_const_false;
    items[2] = rx_msg.rtr ? mp_const_true : mp_const_false;

    // Return the result
    return ret_obj;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(machine_can_recv_obj, 1, machine_can_recv);

// Clear filters setting
static mp_obj_t machine_can_clear_filters(mp_obj_t self_in) {
    machine_can_obj_t *self = MP_OBJ_TO_PTR(self_in);

