micropython/micropython/ports/esp32/machine_can.c
    // Defaults from TWAI_FILTER_CONFIG_ACCEPT_ALL
    self->f_config = (twai_filter_config_t)TWAI_FILTER_CONFIG_ACCEPT_ALL();

    // Apply filter
    check_esp_err(twai_stop_v2(self->handle));
    check_esp_err(twai_driver_uninstall_v2(self->handle));
    check_esp_err(twai_driver_install_v2(&self->g_config, &self->t_config, &self->f_config, &self->handle));
    check_esp_err(twai_start_v2(self->handle));
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_can_clear_filters_obj, machine_can_clear_filters);

// bank: 0 only
// mode: FILTER_RAW_SINGLE, FILTER_RAW_DUAL or FILTER_ADDR_SINGLE or FILTER_ADDR_DUAL
// params: [id, mask]
// rtr: ignored if FILTER_RAW
// Set CAN HW filter
// CAN.set_filters(filters)
static mp_obj_t machine_can_set_filters(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_bank, ARG_mode, ARG_params, ARG_rtr, ARG_extframe };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_bank,     MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_mode,     MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_params,   MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_rtr,      MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_bool = false} },
        { MP_QSTR_extframe, MP_ARG_BOOL,                  {.u_bool = false} },
    };

    // parse args
    machine_can_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);
    const int can_idx = args[ARG_bank].u_int;

    if (can_idx != 0) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("Bank (%d) doesn't exist"), can_idx);
    }

    size_t len;
    mp_obj_t *params;
    mp_obj_get_array(args[ARG_params].u_obj, &len, &params);
    const int mode = args[ARG_mode].u_int;

    uint32_t id = mp_obj_get_int(params[0]);
    uint32_t mask = mp_obj_get_int(params[1]); // FIXME: Overflow in case 0xFFFFFFFF for mask
    if (mode == FILTER_RAW_SINGLE || mode == FILTER_RAW_DUAL) {
        if (len != 2) {
            mp_raise_ValueError(MP_ERROR_TEXT("params must be a 2-values list"));
        }
        self->f_config.single_filter = (mode == FILTER_RAW_SINGLE);
        self->f_config.acceptance_code = id;
        self->f_config.acceptance_mask = mask;
    } else {
        self->f_config.single_filter = self->extframe;
        // machine_can_set_filters(self, id, mask, args[ARG_bank].u_int, args[ARG_rtr].u_int);
        // Check if bank is allowed
        int bank = 0;
        if (bank > ((self->extframe && self->f_config.single_filter) ? 0 : 1)) {
            mp_raise_ValueError(MP_ERROR_TEXT("CAN filter parameter error"));
        }
        uint32_t preserve_mask;
        int addr = 0;
        int rtr = 0;
        if (self->extframe) {
            addr = (addr & 0x1FFFFFFF) << 3 | (rtr ? 0x04 : 0);
            mask = (mask & 0x1FFFFFFF) << 3 | 0x03;
            preserve_mask = 0;
        } else if (self->f_config.single_filter) {
            addr = (((addr & 0x7FF) << 5) | (rtr ? 0x10 : 0));
            mask = ((mask & 0x7FF) << 5);
            mask |= 0xFFFFF000;
            preserve_mask = 0;
        } else {
            addr = (((addr & 0x7FF) << 5) | (rtr ? 0x10 : 0));
            mask = ((mask & 0x7FF) << 5);
            preserve_mask = 0xFFFF << (bank == 0 ? 16 : 0);
            if ((self->f_config.acceptance_mask & preserve_mask) == (0xFFFF << (bank == 0 ? 16 : 0))) {
                // Other filter accepts all; it will replaced duplicating current filter
                addr = addr | (addr << 16);
                mask = mask | (mask << 16);
                preserve_mask = 0;
            } else {
                addr = addr << (bank == 1 ? 16 : 0);
                mask = mask << (bank == 1 ? 16 : 0);
            }
        }
        self->f_config.acceptance_code &= preserve_mask;
        self->f_config.acceptance_code |= addr;
        self->f_config.acceptance_mask &= preserve_mask;
        self->f_config.acceptance_mask |= mask;
    }
    // Apply filter
    if (self->handle) {
        check_esp_err(twai_stop_v2(self->handle));
        check_esp_err(twai_driver_uninstall_v2(self->handle));
    }
    check_esp_err(twai_driver_install_v2(&self->g_config, &self->t_config, &self->f_config, &self->handle));
    check_esp_err(twai_start_v2(self->handle));
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(machine_can_set_filters_obj, 1, machine_can_set_filters);

// CAN.irq_recv(callback, hard=False)
static mp_obj_t machine_can_irq_recv(mp_obj_t self_in, mp_obj_t callback_in) {
    machine_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (callback_in == mp_const_none) {
        // disable callback
        self->rx_callback = mp_const_none;
    } else if (mp_obj_is_callable(callback_in)) {
        // set up interrupt
        self->rx_callback = callback_in;
    }
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(machine_can_irq_recv_obj, machine_can_irq_recv);

// CAN.irq_send(callback, hard=False)
static mp_obj_t machine_can_irq_send(mp_obj_t self_in, mp_obj_t callback_in) {
    machine_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    // mp_obj_t callback_in = NULL;
    if (callback_in == mp_const_none) {
        // disable callback
        self->tx_callback = mp_const_none;
    } else if (mp_obj_is_callable(callback_in)) {
        // set up interrupt
        self->tx_callback = callback_in;
    }
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(machine_can_irq_send_obj, machine_can_irq_send);

// CAN.get_timings([list])
static mp_obj_t machine_can_get_timings(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(machine_can_get_timings_obj, 3, machine_can_get_timings);

// CAN.mode([mode])
static mp_obj_t machine_can_mode(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(machine_can_mode_obj, 3, machine_can_mode);

// Clear TX Queue
static mp_obj_t machine_can_cancel_send(mp_obj_t self_in) {
    const machine_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    return mp_obj_new_bool(twai_clear_transmit_queue_v2(self->handle) == ESP_OK);
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_can_cancel_send_obj, machine_can_cancel_send);

// Clear RX Queue
static mp_obj_t machine_can_clear_rx_queue(mp_obj_t self_in) {
    const machine_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    return mp_obj_new_bool(twai_clear_receive_queue_v2(self->handle) == ESP_OK);
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_can_clear_rx_queue_obj, machine_can_clear_rx_queue);

static const mp_rom_map_elem_t machine_can_locals_dict_table[] = {
    // CAN_ATTRIBUTES
    { MP_ROM_QSTR(MP_QSTR___name__), MP_ROM_QSTR(MP_QSTR_CAN) },
    // MicroPython Generic API
    { MP_ROM_QSTR(MP_QSTR_init), MP_ROM_PTR(&machine_can_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&machine_can_deinit_obj) },
    { MP_ROM_QSTR(MP_QSTR_irq_send), MP_ROM_PTR(&machine_can_irq_send_obj) },
    { MP_ROM_QSTR(MP_QSTR_irq_recv), MP_ROM_PTR(&machine_can_irq_recv_obj) },
    { MP_ROM_QSTR(MP_QSTR_send), MP_ROM_PTR(&machine_can_send_obj) },
    { MP_ROM_QSTR(MP_QSTR_cancel_send), MP_ROM_PTR(&machine_can_cancel_send_obj) },
    { MP_ROM_QSTR(MP_QSTR_recv), MP_ROM_PTR(&machine_can_recv_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_filters), MP_ROM_PTR(&machine_can_set_filters_obj) },
    { MP_ROM_QSTR(MP_QSTR_state), MP_ROM_PTR(&machine_can_state_obj) },
    { MP_ROM_QSTR(MP_QSTR_get_counters), MP_ROM_PTR(&machine_can_get_counters_obj) },
//  { MP_ROM_QSTR(MP_QSTR_any), MP_ROM_PTR(&machine_can_any_obj) },
    { MP_ROM_QSTR(MP_QSTR_clear_filters), MP_ROM_PTR(&machine_can_clear_filters_obj) },
    { MP_ROM_QSTR(MP_QSTR_restart), MP_ROM_PTR(&machine_can_restart_obj) },

    { MP_ROM_QSTR(MP_QSTR_get_timings), MP_ROM_PTR(&machine_can_get_timings_obj) },
    { MP_ROM_QSTR(MP_QSTR_mode), MP_ROM_PTR(&machine_can_mode_obj) },
    // ESP32 Specific API
    { MP_OBJ_NEW_QSTR(MP_QSTR_clear_rx_queue), MP_ROM_PTR(&machine_can_clear_rx_queue_obj) },
    { MP_OBJ_NEW_QSTR(MP_QSTR_get_alerts), MP_ROM_PTR(&machine_can_alert_obj) },
    // CAN_MODE
    // class CAN.Mode
    { MP_ROM_QSTR(MP_QSTR_MODE_NORMAL), MP_ROM_INT(MODE_NORMAL) },
    { MP_ROM_QSTR(MP_QSTR_MODE_SLEEP), MP_ROM_INT(MODE_SLEEP) },
    { MP_ROM_QSTR(MP_QSTR_MODE_LOOPBACK), MP_ROM_INT(MODE_LOOPBACK) },
    { MP_ROM_QSTR(MP_QSTR_MODE_SILENT), MP_ROM_INT(MODE_SILENT) },
    { MP_ROM_QSTR(MP_QSTR_MODE_SILENT_LOOPBACK), MP_ROM_INT(MODE_SILENT_LOOPBACK) },
    { MP_ROM_QSTR(MP_QSTR_MODE_LISTEN_ONLY), MP_ROM_INT(MODE_LISTEN_ONLY) },
    // CAN_STATE
    // class CAN.State
    { MP_ROM_QSTR(MP_QSTR_STATE_STOPPED), MP_ROM_INT(TWAI_STATE_STOPPED) },
    { MP_ROM_QSTR(MP_QSTR_STATE_ACTIVE), MP_ROM_INT(TWAI_STATE_RUNNING) },
    { MP_ROM_QSTR(MP_QSTR_STATE_WARNING), MP_ROM_INT(-1) },
    { MP_ROM_QSTR(MP_QSTR_STATE_PASSIVE), MP_ROM_INT(-1) },
    { MP_ROM_QSTR(MP_QSTR_STATE_BUS_OFF), MP_ROM_INT(TWAI_STATE_BUS_OFF) },
    { MP_ROM_QSTR(MP_QSTR_STATE_RECOVERING), MP_ROM_INT(TWAI_STATE_RECOVERING) }, // esp32 specific

    // class CAN.MessageFlags
    { MP_ROM_QSTR(MP_QSTR_FLAG_RTR), MP_ROM_INT(FLAG_RTR) },
    { MP_ROM_QSTR(MP_QSTR_FLAG_EXT_ID), MP_ROM_INT(FLAG_EXT_ID) },
    { MP_ROM_QSTR(FLAG_UNORDERED), MP_ROM_INT(FLAG_UNORDERED) },
//    { MP_ROM_QSTR(MP_QSTR_FLAG_FD_F), MP_ROM_INT(FLAG_FD_F) },
//    { MP_ROM_QSTR(MP_QSTR_FLAG_BRS), MP_ROM_INT(FLAG_BRS) },
    // class CAN.RecvErrors
    { MP_ROM_QSTR(MP_QSTR_RECV_ERR_FULL), MP_ROM_INT(RECV_ERR_FULL) },
    { MP_ROM_QSTR(MP_QSTR_RECV_ERR_OVERRUN), MP_ROM_INT(RECV_ERR_OVERRUN) },
    { MP_ROM_QSTR(MP_QSTR_RECV_ERR_ESI), MP_ROM_INT(RECV_ERR_ESI) },
    // class CAN.SendErrors
    { MP_ROM_QSTR(MP_QSTR_ARB), MP_ROM_INT(ARB) },
    { MP_ROM_QSTR(MP_QSTR_NACK), MP_ROM_INT(NACK) },
    { MP_ROM_QSTR(MP_QSTR_ERR), MP_ROM_INT(ERR) },
    // CAN_FILTER_MODE
    { MP_ROM_QSTR(MP_QSTR_FILTER_RAW_SINGLE), MP_ROM_INT(FILTER_RAW_SINGLE) },
    { MP_ROM_QSTR(MP_QSTR_FILTER_RAW_DUAL), MP_ROM_INT(FILTER_RAW_DUAL) },
    { MP_ROM_QSTR(MP_QSTR_FILTER_ADDRESS), MP_ROM_INT(FILTER_ADDRESS) },
    // CAN_ALERT
    { MP_ROM_QSTR(MP_QSTR_ALERT_TX_IDLE), MP_ROM_INT(TWAI_ALERT_TX_IDLE) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_TX_SUCCESS), MP_ROM_INT(TWAI_ALERT_TX_SUCCESS) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_RX_DATA), MP_ROM_INT(TWAI_ALERT_RX_DATA) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_BELOW_ERR_WARN), MP_ROM_INT(TWAI_ALERT_BELOW_ERR_WARN) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_ERR_ACTIVE), MP_ROM_INT(TWAI_ALERT_ERR_ACTIVE) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_RECOVERY_IN_PROGRESS), MP_ROM_INT(TWAI_ALERT_RECOVERY_IN_PROGRESS) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_BUS_RECOVERED), MP_ROM_INT(TWAI_ALERT_BUS_RECOVERED) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_ARB_LOST), MP_ROM_INT(TWAI_ALERT_ARB_LOST) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_ABOVE_ERR_WARN), MP_ROM_INT(TWAI_ALERT_ABOVE_ERR_WARN) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_BUS_ERROR), MP_ROM_INT(TWAI_ALERT_BUS_ERROR) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_TX_FAILED), MP_ROM_INT(TWAI_ALERT_TX_FAILED) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_RX_QUEUE_FULL), MP_ROM_INT(TWAI_ALERT_RX_QUEUE_FULL) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_ERR_PASS), MP_ROM_INT(TWAI_ALERT_ERR_PASS) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_BUS_OFF), MP_ROM_INT(TWAI_ALERT_BUS_OFF) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_RX_FIFO_OVERRUN), MP_ROM_INT(TWAI_ALERT_RX_FIFO_OVERRUN) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_TX_RETRIED), MP_ROM_INT(TWAI_ALERT_TX_RETRIED) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_PERIPH_RESET), MP_ROM_INT(TWAI_ALERT_PERIPH_RESET) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_ALL), MP_ROM_INT(TWAI_ALERT_ALL) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_NONE), MP_ROM_INT(TWAI_ALERT_NONE) }
};
static MP_DEFINE_CONST_DICT(machine_can_locals_dict, machine_can_locals_dict_table);

// Python object definition
MP_DEFINE_CONST_OBJ_TYPE(
    machine_can_type,
    MP_QSTR_CAN,
    MP_TYPE_FLAG_NONE,
    make_new, machine_can_make_new,
    print, machine_can_print,
    locals_dict, (mp_obj_dict_t *)&machine_can_locals_dict
    );

#endif // MICROPY_PY_MACHINE_CAN

#endif // SOC_TWAI_SUPPORTED
